In [53]:
%matplotlib inline

import numpy as np
import pandas as pd

In [54]:
df_shop = pd.read_csv('../data/shop_info.txt', header=None)
df_shop.columns = ['shop_id', 'city_name', 'location_id', 'per_pay',
                             'score', 'comment_cnt', 'shop_level', 'cate_1_name', 'cate_2_name', 'cate_3_name']
df_shop.head()

,shop_id,city_name,location_id,per_pay,score,comment_cnt,shop_level,cate_1_name,cate_2_name,cate_3_name
0,1,湖州,885,8,4.0,12.0,2,美食,休闲茶饮,饮品/甜点
1,2,哈尔滨,64,19,NaN,NaN,1,超市便利店,超市,NaN
2,3,南昌,774,5,3.0,2.0,0,美食,休闲茶饮,奶茶
3,4,天津,380,18,NaN,NaN,1,超市便利店,超市,NaN
4,5,杭州,263,2,2.0,2.0,0,美食,休闲食品,生鲜水果

In [55]:
df_city_dummies = pd.get_dummies(df_shop['city_name'])
df_shop = df_shop.join(df_city_dummies)
df_shop.head()

,shop_id,city_name,location_id,per_pay,score,comment_cnt,shop_level,cate_1_name,cate_2_name,cate_3_name,...,镇江,长沙,长治,阜阳,阳江,青岛,黄冈,黄山,黄石,龙岩
0,1,湖州,885,8,4.0,12.0,2,美食,休闲茶饮,饮品/甜点,...,0,0,0,0,0,0,0,0,0,0
1,2,哈尔滨,64,19,NaN,NaN,1,超市便利店,超市,NaN,...,0,0,0,0,0,0,0,0,0,0
2,3,南昌,774,5,3.0,2.0,0,美食,休闲茶饮,奶茶,...,0,0,0,0,0,0,0,0,0,0
3,4,天津,380,18,NaN,NaN,1,超市便利店,超市,NaN,...,0,0,0,0,0,0,0,0,0,0
4,5,杭州,263,2,2.0,2.0,0,美食,休闲食品,生鲜水果,...,0,0,0,0,0,0,0,0,0,0

In [56]:
cate1_dummies = pd.get_dummies(df_shop['cate_1_name'],prefix='cate1')
cate2_dummies = pd.get_dummies(df_shop['cate_2_name'],prefix='cate2')
cate3_dummies = pd.get_dummies(df_shop['cate_3_name'],prefix='cate3')
df_shop = df_shop.join(cate1_dummies)
df_shop = df_shop.join(cate2_dummies)
df_shop = df_shop.join(cate3_dummies)
df_shop.head()

,shop_id,city_name,location_id,per_pay,score,comment_cnt,shop_level,cate_1_name,cate_2_name,cate_3_name,...,cate3_西北菜,cate3_西式快餐,cate3_西餐,cate3_闽菜,cate3_零食,cate3_面包,cate3_面点,cate3_饮品/甜点,cate3_香锅/烤鱼,cate3_麻辣烫/串串香
0,1,湖州,885,8,4.0,12.0,2,美食,休闲茶饮,饮品/甜点,...,0,0,0,0,0,0,0,1,0,0
1,2,哈尔滨,64,19,NaN,NaN,1,超市便利店,超市,NaN,...,0,0,0,0,0,0,0,0,0,0
2,3,南昌,774,5,3.0,2.0,0,美食,休闲茶饮,奶茶,...,0,0,0,0,0,0,0,0,0,0
3,4,天津,380,18,NaN,NaN,1,超市便利店,超市,NaN,...,0,0,0,0,0,0,0,0,0,0
4,5,杭州,263,2,2.0,2.0,0,美食,休闲食品,生鲜水果,...,0,0,0,0,0,0,0,0,0,0

In [89]:
df_shop=df_shop.drop(['location_id','cate_1_name','cate_2_name','cate_3_name'],axis=1)

df_shop.to_csv('../data/shop_basic_info.csv',index=False)

In [59]:
df_pay = pd.read_csv('../data/user_pay.txt',header=None)
df_pay.columns = ['user_id', 'shop_id', 'timestamp']
df_pay.head()

    user_id  shop_id            timestamp
0   3434231     1862  2016-10-05 11:00:00
1  20244878     1862  2016-09-17 15:00:00
2  13211167     1862  2016-09-29 20:00:00
3  17609360     1862  2016-10-15 17:00:00
4  15262746     1862  2016-10-18 19:00:00

In [66]:
df_pay['date'] = df_pay['timestamp'].apply(lambda x:x[:10])
df_pay = df_pay[(df_pay['date']>='2016-09-06')&(df_pay['date']<='2016-10-31')]
df_pay = df_pay[(df_pay['date']>'2016-10-07')|(df_pay['date']<'2016-10-01')]
df_pay.head()

    user_id  shop_id            timestamp        date
1  20244878     1862  2016-09-17 15:00:00  2016-09-17
2  13211167     1862  2016-09-29 20:00:00  2016-09-29
3  17609360     1862  2016-10-15 17:00:00  2016-10-15
4  15262746     1862  2016-10-18 19:00:00  2016-10-18
5  11775594     1862  2016-09-25 17:00:00  2016-09-25

In [69]:
df_agg = df_pay.groupby(['shop_id','date']).agg({
    'timestamp':['min','max','size'],
}).reset_index()
df_agg.columns = ['shop_id','date','min_ts','max_ts','pay_count']
df_agg.head()

   shop_id        date               min_ts               max_ts  pay_count
0        1  2016-09-06  2016-09-06 07:00:00  2016-09-06 22:00:00        262
1        1  2016-09-07  2016-09-07 07:00:00  2016-09-07 22:00:00        251
2        1  2016-09-08  2016-09-08 07:00:00  2016-09-08 22:00:00        283
3        1  2016-09-09  2016-09-09 07:00:00  2016-09-09 22:00:00        274
4        1  2016-09-10  2016-09-10 07:00:00  2016-09-10 22:00:00        252

In [71]:
import numpy as np
df_agg['operate_hour'] = ((pd.to_datetime(df_agg['max_ts'])-pd.to_datetime(df_agg['min_ts']))/ np.timedelta64(1, 'h')).astype(int)
df_agg.head()

,shop_id,date,min_ts,max_ts,pay_count,operate_hour
0,1,2016-09-06,2016-09-06 07:00:00,2016-09-06 22:00:00,262,15
1,1,2016-09-07,2016-09-07 07:00:00,2016-09-07 22:00:00,251,15
2,1,2016-09-08,2016-09-08 07:00:00,2016-09-08 22:00:00,283,15
3,1,2016-09-09,2016-09-09 07:00:00,2016-09-09 22:00:00,274,15
4,1,2016-09-10,2016-09-10 07:00:00,2016-09-10 22:00:00,252,15

In [72]:
df_agg['dayofweek'] = pd.to_datetime(df_agg['date']).dt.dayofweek
# 需要处理节假日及调休

def deal_holiday(x):
    result = 1 if pd.to_datetime(x).strftime("%w") in ['0', '6'] else 0
    if x in ['2016-09-15','2016-09-16','2016-09-17']:
        result=1
    if x in ['2016-09-18','2016-10-08','2016-10-09']:
        result=0
    return result

df_agg['is_holiday'] = df_agg['date'].apply(deal_holiday)

In [73]:
df_agg['is_teacher_day'] = df_agg['date'].apply(lambda x:1 if x=='2016-09-10' else 0)
df_agg['is_moon_day'] = df_agg['date'].apply(lambda x:1 if x=='2016-09-15' else 0)
df_agg.head()

,shop_id,date,min_ts,max_ts,pay_count,operate_hour,dayofweek,is_holiday,is_teacher_day,is_moon_day
0,1,2016-09-06,2016-09-06 07:00:00,2016-09-06 22:00:00,262,15,1,0,0,0
1,1,2016-09-07,2016-09-07 07:00:00,2016-09-07 22:00:00,251,15,2,0,0,0
2,1,2016-09-08,2016-09-08 07:00:00,2016-09-08 22:00:00,283,15,3,0,0,0
3,1,2016-09-09,2016-09-09 07:00:00,2016-09-09 22:00:00,274,15,4,0,0,0
4,1,2016-09-10,2016-09-10 07:00:00,2016-09-10 22:00:00,252,15,5,1,1,0

In [76]:
# df_agg[['shop_id','date','pay_count','operate_hour','dayofweek','dayofweek']]
day_week_config = {
'2016-09-06':1,
'2016-09-07':1,
'2016-09-08':1,
'2016-09-09':1,
'2016-09-10':1,
'2016-09-11':1,
'2016-09-12':1,

'2016-09-13':2,
'2016-09-14':2,
'2016-09-15':2,
'2016-09-16':2,
'2016-09-17':2,
'2016-09-18':2,
'2016-09-19':2,

'2016-09-20':3,
'2016-09-21':3,
'2016-09-22':3,
'2016-09-23':3,
'2016-09-24':3,
'2016-09-25':3,
'2016-09-26':3,

'2016-09-27':4,
'2016-09-28':4,
'2016-09-29':4,
'2016-09-30':4,
'2016-10-08':4,
'2016-10-09':4,
'2016-10-10':4,

'2016-10-11':5,
'2016-10-12':5,
'2016-10-13':5,
'2016-10-14':5,
'2016-10-15':5,
'2016-10-16':5,
'2016-10-17':5,

'2016-10-18':6,
'2016-10-19':6,
'2016-10-20':6,
'2016-10-21':6,
'2016-10-22':6,
'2016-10-23':6,
'2016-10-24':6,

'2016-10-25':7,
'2016-10-26':7,
'2016-10-27':7,
'2016-10-28':7,
'2016-10-29':7,
'2016-10-30':7,
'2016-10-31':7
}
df_agg['week_id'] = df_agg['date'].apply(lambda x:day_week_config.get(x))
df_agg.head()

,shop_id,date,min_ts,max_ts,pay_count,operate_hour,dayofweek,is_holiday,is_teacher_day,is_moon_day,week_id
0,1,2016-09-06,2016-09-06 07:00:00,2016-09-06 22:00:00,262,15,1,0,0,0,1
1,1,2016-09-07,2016-09-07 07:00:00,2016-09-07 22:00:00,251,15,2,0,0,0,1
2,1,2016-09-08,2016-09-08 07:00:00,2016-09-08 22:00:00,283,15,3,0,0,0,1
3,1,2016-09-09,2016-09-09 07:00:00,2016-09-09 22:00:00,274,15,4,0,0,0,1
4,1,2016-09-10,2016-09-10 07:00:00,2016-09-10 22:00:00,252,15,5,1,1,0,1

In [79]:
df_agg.drop(['min_ts','max_ts'],axis=1)

,shop_id,date,pay_count,operate_hour,dayofweek,is_holiday,is_teacher_day,is_moon_day,week_id
0,1,2016-09-06,262,15,1,0,0,0,1
1,1,2016-09-07,251,15,2,0,0,0,1
2,1,2016-09-08,283,15,3,0,0,0,1
3,1,2016-09-09,274,15,4,0,0,0,1
4,1,2016-09-10,252,15,5,1,1,0,1
...,...,...,...,...,...,...,...,...,...
96709,2000,2016-10-27,132,12,3,0,0,0,7
96710,2000,2016-10-28,133,11,4,0,0,0,7
96711,2000,2016-10-29,67,11,5,1,0,0,7
96712,2000,2016-10-30,67,10,6,1,0,0,7
96713,2000,2016-10-31,168,10,0,0,0,0,7

In [85]:
dim_list = []
shop_id = df_agg['shop_id'].unique()
date_list = df_agg['date'].unique()
for _id in shop_id:
    for date in date_list:
        data = {'shop_id':_id,'date':date}
        dim_list.append(data)
df_dim = pd.DataFrame(dim_list)
df_dim.head()

   shop_id        date
0        1  2016-09-06
1        1  2016-09-07
2        1  2016-09-08
3        1  2016-09-09
4        1  2016-09-10

In [86]:
df = pd.merge(df_dim,df_agg,how='left').fillna(0)
df.head()

,shop_id,date,min_ts,max_ts,pay_count,operate_hour,dayofweek,is_holiday,is_teacher_day,is_moon_day,week_id
0,1,2016-09-06,2016-09-06 07:00:00,2016-09-06 22:00:00,262.0,15.0,1.0,0.0,0.0,0.0,1.0
1,1,2016-09-07,2016-09-07 07:00:00,2016-09-07 22:00:00,251.0,15.0,2.0,0.0,0.0,0.0,1.0
2,1,2016-09-08,2016-09-08 07:00:00,2016-09-08 22:00:00,283.0,15.0,3.0,0.0,0.0,0.0,1.0
3,1,2016-09-09,2016-09-09 07:00:00,2016-09-09 22:00:00,274.0,15.0,4.0,0.0,0.0,0.0,1.0
4,1,2016-09-10,2016-09-10 07:00:00,2016-09-10 22:00:00,252.0,15.0,5.0,1.0,1.0,0.0,1.0

In [91]:
# df.drop(['min_ts','max_ts'],axis=1,inplace=True)
df.to_csv('../data/pay_stat_day.csv',index=False)